""" 
Розробіть функцію normalize_phone(phone_number),
що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку. 
Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. 
Якщо номер не містить міжнародного коду, функція автоматично додає код '+38' (для України). 
Це гарантує, що всі номери будуть придатними для відправлення SMS.

Вимоги до завдання:
1.Параметр функції phone_number - це рядок з телефонним номером у різноманітних форматах.
2.Функція видаляє всі символи, крім цифр та символу '+'.
3.Якщо міжнародний код відсутній, функція додає код '+38'. 
Це враховує випадки, коли номер починається з '380' (додається лише '+') та коли номер починається без коду (додається '+38').
4.Функція повертає нормалізований телефонний номер у вигляді рядка.
"""
import re

def normalize_phone(phone_number):
    pattern = r"[\D]"
    replacement = ""
    formated_str = re.sub(pattern, replacement, phone_number)
    if len(formated_str) == 12:
        normilized_phone_number = '+' + formated_str
    elif len(formated_str) == 10:
        normilized_phone_number = '+38' + formated_str
    return normilized_phone_number

raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]

sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)